# EtherChannel 配置指南

接下来的小节，列出并描述了配置二层 PAgP EtherChannel 所需的步骤。不过，在深入了解这些配置步骤前，重要的是咱们要熟悉在配置二层 EtherChannel 时的以下注意事项：

- 每个 EtherChannel 最多可以有八个兼容配置的以太网接口。LACP 允许咱们在一个 EtherChannel 组中有八个以上的端口。这些额外端口属于热备端口；
- EtherChannel 中的所有接口，必须以同样速率及双工模式运行。但请记住，与 PAgP 不同，LACP 不支持半双工的端口；
- 确保 EtherChannel 中的所有接口都被启动。在某些情况下，当接口未启用时，那么逻辑端口通道接口将不会被自动创建；
- 首次配置某个 EtherChannel 组时，重要的是要记住，端口要依照第一个添加的组端口所设置的参数；
- 当 [交换端口分析器 (Switched Port Analyzer, SPAN)](https://www.cisco.com/c/en/us/support/docs/switches/catalyst-6500-series-switches/10570-41.html) 在 EtherChannel 中某个成员端口上配置了时，那么该端口将从 EtherChannel 组中移除；
- 将 EtherChannel 中的所有接口，都分配到同一 VLAN，或将他们配置为中继链路非常重要。若这些参数不同，那么通道将无法形成；
- 请记住，有着不同 STP 路径开销（由管理员控制）的类似接口，仍可用于形成 EtherChannel。

建议在开始通道配置前，关闭所有成员接口。

## 配置与验证二层的 EtherChannel

这一小节通过无条件地强制所选接口建立以太通道，介绍了二层 EtherChannel 的配置。

1. 第一个配置步骤，是经由 `interface [name]` 或 `interface range [range]` 全局配置命令，进入想要的 EtherChannel 接口的接口配置模式；
2. 第二个配置步骤，是经由 `switchport` 这个接口配置命令，将这些接口配置为二层的交换机端口；
3. 第三步配置，是经由 `switchport mode [access|trunk]` 这个接口配置命令，将这些交换机端口配置为中继链路或接入链路；
4. 作为可选项，当这个接口或这些接口，已被配置为接入端口时，那么就要使用 `switchport access vlan [number]` 命令，将他们分配到同一 VLAN。而当这个接口或这些接口，已被配置为中继端口时，则通过使用 `switchport trunk allowed vlan [range]` 这个接口配置命令，选择允许穿越该中继链路的 VLAN。若 `VLAN 1` 将不被用作原生 VLAN（对于 802.1Q），则要通过使用 `switchport trunk native vlan [number]` 这个接口配置命令输入本地 VLAN。在所有端口通道的成员接口上，这一配置必须一致；
5. 下一配置步骤是要经由 `channel-group [number] mode on` 这个接口配置命令，将这些接口配置为无条件中继。


> **译注**：在 NX-OSv 7k Titanium 中，执行 `channel-group [number] mode on` 命令时，会报出 `Stub Library could not be opened` 错误，表明所需的支持库（比如 `libdstats_eth.so` 或 `libdot1xshow.so` 等）未在这一版本或较低版本的虚拟机镜像中实现，或不可用。
>
> 需要使用更新的 NX-OSv 镜像，或升级现有镜像，或使用支持这些二层特性其他平台，比如 dynamips 的镜像。


通过使用上述步骤的无条件 EtherChannel 配置，将基于下图 11.5 中所示的网络拓扑结构。


![以太网通道配置输出示例的网络拓扑](../images/3305.png)

<a name="f-11.5"></a>
**图 11.5** -- **用于 EtherChannel 配置输出示例的网络拓扑**

以下输出演示了基于图 11.5 中所示的网络拓扑，在 `Switch 1` 和 `Switch 2` 上如何配置无条件通道。这条 EtherChannel 将使用默认参数，被配置为一条二层的 802.1Q 中继链路。


```console
Switch-1#conf t
Enter configuration commands, one per line. End with CNTL/Z.
Switch-1(config)#interface range fa0/1 – 3
Switch-1(config-if-range)#no shutdown
Switch-1(config-if-range)#switchport
Switch-1(config-if-range)#switchport trunk encapsulation dot1q
Switch-1(config-if-range)#switchport mode trunk
Switch-1(config-if-range)#channel-group 1 mode on
Creating a port-channel interface Port-channel 1
Switch-1(config-if-range)#exit
Switch-1(config)#exit
```

**注意**：请注意，默认情况下交换机会自动创建 `interface port-channel 1`（请参阅下面的输出）。配置这一接口无需显式的用户配置。

```console
Switch-2#conf t
Enter configuration commands, one per line. End with CNTL/Z.
Switch-2(config)#interface range fa0/1 - 3
Switch-2(config-if-range)#switchport
Switch-2(config-if-range)#switchport trunk encapsulation dot1q
Switch-2(config-if-range)#switchport mode trunk
Switch-2(config-if-range)#channel-group 1 mode on
Creating a port-channel interface Port-channel 1
Switch-2(config-if-range)#exit
Switch-2(config)#exit
```

随后 `show EtherChannel [options]` 命令便可用于验证这条 EtherChannel 的配置。可用选项（这会因平台而异）打印在以下输出中：

```console
Switch-2#show EtherChannel ?
    <1-6>           Channel group number
    detail          Detail information
    load-balance    Load-balance/frame-distribution scheme among ports in port-channel
    port            Port information
    port-channel    Port-channel information
    protocol        protocol enabled
    summary         One-line summary per channel-group
    |               Output modifiers
    <cr>
```

以下输出演示了 `show EtherChannel summary` 这条命令：

```console
Switch-2#show EtherChannel summary
Flags:  D - down
        I - stand-alone
        H - Hot-standby (LACP only)
        R - Layer3
        u - unsuitable for bundling
        U - in use
        d - default port
        P - in port-channel
        s - suspended
        S - Layer2
        f - failed to allocate aggregator

Number of channel-groups in use: 1
Number of aggregators: 1

Group  Port-channel  Protocol    Ports
------+-------------+-----------+--------------------------------
1      Po1(SU)          -        Fa0/1(Pd)  Fa0/2(P)    Fa0/3(P)
```

在上面的输出中，咱们可以看到，通道组 1 中有三条链路。接口 `FastEthernet0/1` 是默认端口；例如，这个端口将被用于发送 STP 的数据包。当这个端口失效时，`FastEthernet0/2` 将被指定为默认端口，以此类推。通过查看 `Po1` 旁边的 `SU` 标志，咱们还可看出，这是条活动的二层 EtherChannel。以下输出显示了由 `show EtherChannel detail` 命令所打印的信息：


```console
Switch-2#show EtherChannel detail
                Channel-group listing:
                ----------------------

Group: 1
----------
Group state = L2
Ports: 3    Maxports = 8
Port-channels: 1 Max Port-channels = 1
Protocol:    -
                Ports in the group:
                -------------------

Port: Fa0/1
------------

Port state      = Up Mstr In-Bndl
Channel group   = 1           Mode  = On/FEC           Gcchange = -
Port-channel    = Po1         GC    = -     Pseudo port-channel = Pol
Port index      = 0           Load  = 0x00             Protocol = -

Age of the port in the current state: 0d:00h:20m:20s

Port: Fa0/2
------------

Port state      = Up Mstr In-Bndl
Channel group   = 1           Mode  = On/FEC           Gcchange = -
Port-channel    = Po1         GC    = -     Pseudo port-channel = Pol
Port index      = 0           Load  = 0x00             Protocol = -

Age of the port in the current state: 0d:00h:21m:20s

Port: Fa0/3
------------

Port state      = Up Mstr In-Bndl
Channel group   = 1           Mode  = On/FEC           Gcchange = -
Port-channel    = Po1         GC    = -     Pseudo port-channel = Pol
Port index      = 0           Load  = 0x00             Protocol = -

Age of the port in the current state: 0d:00h:21m:20s

                Port-channels in the group:
                ---------------------------

Port-channel: Po1
------------

Age of the Port-channel     = 0d:00h:26m:23s
Logical slot/port   = 1/0               Number of ports = 3
GC                  = 0x00000000        HotStandBy port = null
Port state          = Port-channel Ag-Inuse
Protocol            = -

Ports in the Port-channel:

Index   Load   Port     EC state        No of bits
------+------+------+------------------+-----------
0       00     Fa0/1    On/FEC          0
0       00     Fa0/2    On/FEC          0
0       00     Fa0/3    On/FEC          0

Time since last port bundled:   0d:00h:21m:20s     Fa0/3
```

在上面的输出中，咱们可以看到，这是条通道组中最多可能的 8 个中 3 个端口的二层 EtherChannel。根据由破折号 (`-`) 所表示的协议，咱们还可以看出其中 EtherChannel 模式为 `on`。此外，咱们还可以看到，这是一条 FastEtherChannel (FEC)。


最后，咱们还可通过执行 `show interfaces port-channel [number] switchport` 命令，验证其中逻辑端口通道接口的二层运行状态。这在以下输出中得已演示：


```console
Switch-2#show interfaces port-channel 1 switchport
Name: Po1
Switchport: Enabled
Administrative Mode: trunk
Operational Mode: trunk
Administrative Trunking Encapsulation: dot1q
Operational Trunking Encapsulation: dot1q
Negotiation of Trunking: On
Access Mode VLAN: 1 (default)
Trunking Native Mode VLAN: 1 (default)
Voice VLAN: none
Administrative private-vlan host-association: none
Administrative private-vlan mapping: none
Administrative private-vlan trunk native VLAN: none
Administrative private-vlan trunk encapsulation: dot1q
Administrative private-vlan trunk normal VLANs: none
Administrative private-vlan trunk private VLANs: none
Operational private-vlan: none
Trunking VLANs Enabled: ALL
Pruning VLANs Enabled: 2-1001

Protected: false
Appliance trust: none
```


> *知识点*：
>
> - the configuration of Layer 2 EtherChannels by unconditionally forcing the selected interfaces to establish an EtherChannel
>
> - unconditional channeling
>
> - a Layer 2 802.1Q trunk
>
> - the default port
>
> - an active Layer 2 EtherChannel
>
> - a Layer 2 EtherChannel
>
> - a FastEtherChannel, FEC
>
> - the logical port-channel interface



## 配置并验证 PAgP 的 EtherChannel

这一小节介绍 PAgP 的二层以太通道配置。为了配置和建立一条 PAgP 的 EtherChannel，以下步骤需要被执行：

1. 第一个配置步骤，是经由 `interface [name]` 或 `interface range [range]` 的全局配置命令，进入想要的 EtherChannel 接口的接口配置模式；
2. 第二个配置步骤，是经由 `switchport` 这个接口配置命令，将这些接口配置为二层的交换机端口；
3. 第三个配置步骤，是经由 `switchport mode [access|trunk]` 这个接口配置命令，将这些交换机端口配置为中继或接入链路；
4. 作为可选项，当该接口或这些接口，已被配置为接入端口时，就要使用 `switchport access vlan [number]` 命令，将他们分配到统一 VLAN。当该接口或这些接口已被配置为中继端口时，就要通过使用 `switchport trunk allowed vlan [range]` 这个接口配置命令，选取允许穿越该中继的 VLAN。当 `VLAN 1` 将不被用作原生 VLAN（对于 802.1Q）时，则要使用 `switchport trunk native vlan [number]` 这个配置命令输入原生 VLAN。在所有端口通道的成员接口上，这一配置必须一样；
5. 作为可选项，要通过执行 `channel-protocol pagp` 这条接口配置命令，配置 PAgP 为 EtherChannel 的协议。由于 EtherChannel 默认为 PAgP，因此这条命令被认为是可选的，而不是必需的。执行这一命令只是为了绝对确定咱们的配置，是一种良好做法。
6. 下一配置步骤，是经由 `channel-group [number] mode` 这条接口配置命令，将这些接口配置为无条件中继。

以下输出演示了如何根据上述 [图 11.5](#f-11.5) 中描述的网络拓扑，在 `Switch 1` 和 `Switch 2` 上配置 PAgP 通道。这条 EtherChannel 将使用默认参数，配置为一条二层的 802.1Q 中继链路。


```console
Switch-1#conf t
Enter configuration commands, one per line. End with CNTL/Z.
Switch-1(config)#interface range fa0/1 - 3
Switch-1(config-if-range)#switchport
Switch-1(config-if-range)#switchport trunk encap dot1q
Switch-1(config-if-range)#switchport mode trunk
Switch-1(config-if-range)#channel-group 1 mode desirable
Creating a port-channel interface Port-channel 1
Switch-1(config-if-range)#exit
```

**注意**： 在上述输出中，端口通道的 `desirable` 模式已被选取。一个额外关键字 `[non-silent]` 可被追加到这条命令末尾。这是因为默认情况下， PAgP的 `auto` 模式和 `desirable` 模式均默认为静默模式。当交换机连接到一台不具备 PAgP 能力，且很少，若有的话，传输数据包的设备时，静默模式就会被用到。静默方的一个示例，便是不产生流量的文件服务器，或数据包分析仪。当某个设备不会发送 PAP 数据包（如在 `auto` 模式下）时，静默模式也会被用到。

在这种情况下，在某个连接到静默方的物理端口上运行 PAgP，便会该阻止交换机端口投入运行；但是，这种静默设置，会允许 PAgP 运行，以将该接口纳入某个通道组，并将该接口用于传输。在这个示例中，由于 `Switch 2` 将配置为 `auto` 模式（`passive` 模式），因此端口最好使用默认的静默模式运行。这在下面的 PAgP EtherChannel 配置输出中得以演示。


```console
Switch-1#conf t
Enter configuration commands, one per line. End with CNTL/Z.
Switch-1(config)#interface range fa0/1 - 3
Switch-1(config-if-range)#switchport
Switch-1(config-if-range)#switchport trunk encap dot1q
Switch-1(config-if-range)#switchport mode trunk
Switch-1(config-if-range)#channel-group 1 mode desirable ?
    non-silent  Start negotiation only after data packets received
    <cr>
Switch-1(config-if-range)#channel-group 1 mode desirable non-silent
Creating a port-channel interface Port-channel 1
Switch-1(config-if-range)#exit
```

继续 PAgP EtherChannel 的配置，`Switch 2` 被配置为如下：


```console
Switch-2#conf t
Enter configuration commands, one per line. End with CNTL/Z.
Switch-2(config)#int range fa0/1 - 3
Switch-2(config-if-range)#switchport
Switch-2(config-if-range)#switchport trunk encapsulation dot1q
Switch-2(config-if-range)#switchport mode trunk
Switch-2(config-if-range)#channel-group 1 mode auto
Creating a port-channel interface Port-channel 1
Switch-2(config-if-range)#exit
```

以下输出演示了如何在 `Switch 1` 和 `Switch 2` 上，使用 `show EtherChannel summary` 命令验证 PAgP 的 EtherChannel 配置：


```console
Switch-1#show EtherChannel summary
Flags:  D - down
        I - stand-alone
        H - Hot-standby (LACP only)
        R - Layer3
        u - unsuitable for bundling
        U - in use
        d - default port
        P - in port-channel
        s - suspended
        S - Layer2
        f - failed to allocate aggregator

Number of channel-groups in use:    1
Number of aggregators:              1

Group  Port-channel  Protocol    Ports
------+-------------+-----------+--------------------------------
1      Po1(SU)         PAgP      Fa0/1(Pd)  Fa0/2(P)    Fa0/3(P)
```


PAgP 的 EtherChannel 配置及统计信息，也可通过执行 `show pagp [options]` 命令查看。这条命令下的可用选项如下输出中所示：

```console
Switch-1#show pagp ?
  <1-6>     Channel group number
  counters  Traffic information
  internal  Internal information
  neighbor  Neighbor information
```

**注意**： 输入想要的端口通道编号，就会提供与上面打印出的最后三个选项相同的选项。这在以下输出中得以演示：

```console
Switch-1#show pagp 1 ?
  counters  Traffic information
  internal  Internal information
  neighbor  Neighbor information
```

其中 `[counters]` 关键字提供了有关 PAgP 发送及接收的数据包的信息。`[internal]` 关键字提供了诸如端口状态、`Hello` 间隔、PAgP 端口优先级，以及端口学习方法等的信息。使用 `show pagp internal` 命令，在以下输出中得以演示：

```console
Switch-1#show pagp 1 internal
Flags:  S - Device is sending Slow hello.   C - Device is in Consistent state.
        A - Device is in Auto mode.         d - PAgP is down.
Timers: H - Hello timer is running.         Q - Quit timer is running.
        S - Switching timer is running.     I - Interface timer is running.

Channel group 1
                                Hello       Partner PAgP     Learning   Group
Port    Flags   State   Timers  Interval    Count   Priority Method     Ifindex
Fa0/1   SC      U6/S7   H       30s         1       128      Any        29
Fa0/2   SC      U6/S7   H       30s         1       128      Any        29
Fa0/3   SC      U6/S7   H       30s         1       128      Any        29
```

而 `[neighbor]` 关键字会打印出邻居名字、PAP 邻居的 ID、邻居的设备 ID（MAC），以及邻居的端口等。其中的一些标记，还会表明邻居正运行的模式，以及邻居是否是一个物理的学习者等。使用 `show pagp neighbor` 命令，这在以下输出中得以演示：

```console
Switch-1#show pagp 1 neighbor
Flags:  S - Device is sending Slow hello.   C - Device is in Consistent state.
        A - Device is in Auto mode.         P - Device learns on physical port.

Channel group 1 neighbors
        Partner     Partner         Partner     Partner Group
Port    Name        Device ID       Port    Age Flags   Cap.
Fa0/1   Switch-2    0014.a9e5.d640  Fa0/1   19s SAC     10001
Fa0/2   Switch-2    0014.a9e5.d640  Fa0/2   24s SAC     10001
Fa0/3   Switch-2    0014.a9e5.d640  Fa0/3   18s SAC     10001
```

> *知识点*：
>
> - the configuration of PAgP Layer 2 EtherChannels
>
> - a PAgP EtherChannel
>
> - Interface Configuration mode
>
> - the EtherChannel protocol
>
> - PAgP channeling
>
> - the `silent` mode
>
> - a silent partner
>
> - the default silent mode operation
>
> - `Hello` interval
>
> - PAgP port priority
>
> - the port learning method
>
> - the neighbor name
>
> - ID of the PAgP neighbor
>
> - the neighbor device ID
>
> - the neighbor port
>
> - a physical learner



## 配置并验证 LACP 的 EtherChannel

这一小节介绍 LACP 的二层 EtherChannel 配置。为了配置和建立 LACP 的 EtherChannel，以下步骤需要被执行：

1. 第一个配置步骤，是经由 `interface [name]` 或 `interface range [range]` 的全局配置命令，进入想要的 EtherChannel 接口的接口配置模式；
2. 第二个配置步骤，是经由 `switchport` 这个接口配置命令，将这些接口配置为二层的交换机端口；
3. 第三个配置步骤，是经由 `switchport mode [access|trunk]` 这个接口配置命令，将这些交换机端口配置为中继或接入链路；
4. 作为可选项，当该接口或这些接口，已被配置为接入端口时，就要使用 `switchport access vlan [number]` 命令，将他们分配到统一 VLAN。当该接口或这些接口已被配置为中继端口时，就要通过使用 `switchport trunk allowed vlan [range]` 这个接口配置命令，选取允许穿越该中继的 VLAN。当 `VLAN 1` 将不被用作原生 VLAN（对于 802.1Q）时，则要使用 `switchport trunk native vlan [number]` 这个配置命令输入原生 VLAN。在所有端口通道的成员接口上，这一配置必须一样；
5. 通过使用 `channel-protocol lacp` 这条接口配置命令，将 LACP 配置为 EtherChannel 协议。由于 EtherChannel 默认为 PAaP，因此这条命令被认为对 LACP 是强制性的且是必需的；
6. 下一配置步骤，是经由 `channel-group [number] mode` 这条接口配置命令，将这些接口配置为无条件中继。

下面的输出演示了根据 [图 11.5](#f-11.5) 中所示的网络拓扑，怎样在 `Switch 1` 和 `Switch 2` 上配置 LACP 的通道。如下输出所示，这条 EtherChannel 将使用默认参数，被配置为一条二层的 802.1Q 中继（注意 2960 默认已设置为 `dot1q`）：

```console
Switch-1#conf t
Enter configuration commands, one per line. End with CNTL/Z.
Switch-1(config)#int range FastEthernet0/1 - 3
Switch-1(config-if-range)#switchport
Switch-1(config-if-range)#switchport trunk encapsulation dot1q
Switch-1(config-if-range)#switchport mode trunk
Switch-1(config-if-range)#channel-protocol lacp
Switch-1(config-if-range)#channel-group 1 mode active
Creating a port-channel interface Port-channel 1
Switch-1(config-if-range)#exit
```


```console
Switch-2#conf t
Enter configuration commands, one per line. End with CNTL/Z.
Switch-2(config)#interface range FastEthernet0/1 - 3
Switch-2(config-if-range)#switchport
Switch-2(config-if-range)#switchport trunk encapsulation dot1q
Switch-2(config-if-range)#switchport mode trunk
Switch-2(config-if-range)#channel-protocol lacp
Switch-2(config-if-range)#channel-group 1 mode passive
Creating a port-channel interface Port-channel 1
Switch-2(config-if-range)#exit
```

以下输出演示了在 `Switch 1` 和 `Switch 2` 上，怎样使用 `show EtherChannel summary` 命令验证这条 LACP EtherChannel 的配置：


```console
Switch-1#show EtherChannel summary
Flags:  D - down
        I - stand-alone
        H - Hot-standby (LACP only)
        R - Layer3
        u - unsuitable for bundling
        U - in use
        d - default port
        P - in port-channel
        s - suspended
        S - Layer2
        f - failed to allocate aggregator

Number of channel-groups in use: 1
Number of aggregators: 1

Group  Port-channel  Protocol    Ports
------+-------------+-----------+--------------------------------
1      Po1(SU)       LACP        Fa0/1(Pd)  Fa0/2(P)    Fa0/3(P)
```

默认情况下，LACP 最多允许 16 个端口加入端口通道组。前八个运行接口将被 LACP 所用，而其余八个接口将被置于热备状态。`show EtherChannel detail` 命令显示了 LACP EtherChannel 中支持的最大链路数，如下输出中所示：


```console
Switch-1#show EtherChannel 1 detail
Group state = L2
Ports: 3   Maxports = 16
Port-channels: 1 Max Port-channels = 16
Protocol:   LACP
                Ports in the group:
                -------------------
Port: Fa0/1
------------

Port state    = Up Mstr In-Bndl
Channel group = 1           Mode = Active       Gcchange = -
Port-channel  = Po1         GC   = -        Pseudo port-channel = Po1
Port index    = 0           Load = 0x00         Protocol = LACP

Flags:  S - Device is sending Slow LACPDUs.   F - Device is sending fast
                                                  LACPDUs.
        A - Device is in active mode.         P - Device is in passive mode.

Local information:
                     LACP port     Admin      Oper    Port     Port
Port   Flags  State  Priority      Key        Key     Number   State
Fa0/1  SA     bndl   32768         0x1        0x1     0x0      0x3D

Partner’s information

          Partner                 Partner                    Partner
Port      System ID               Port Number    Age         Flags
Fa0/1     00001,0014.a9e5.d640    0x1            4s          SP

          LACP Partner           Partner        Partner
          Port Priority          Oper Key       Port State
          32768                  0x1            0x3C

Age of the port in the current state: 00d:00h:00m:35s

Port: Fa0/2
------------

Port state      = Up Mstr In-Bndl
Channel group   = 1           Mode  = Active       Gcchange = -
Port-channel    = Po1         GC    = -        Pseudo port-channel = Po1
Port index      = 0           Load  = 0x00         Protocol = LACP

Flags:  S - Device is sending Slow LACPDUs.      F - Device is sending fast
                                                 LACPDUs.
        A - Device is in active mode.            P - Device is in passive mode.

Local information:

                      LACP port   Admin         Oper    Port     Port
Port    Flags  State  Priority    Key           Key     Number   State
Fa0/2   SA     bndl   32768       0x1           0x1     0x1      0x3D

Partner’s information

          Partner               Partner                         Partner
Port      System ID             Port Number         Age         Flags
Fa0/2     00001,0014.a9e5.d640  0x2                 28s         SP

          LACP Partner         Partner             Partner
          Port Priority        Oper Key            Port State
          32768                0x1                 0x3C

Age of the port in the current state: 00d:00h:00m:33s

Port: Fa0/3
------------

Port state      = Up Mstr In-Bndl
Channel group   = 1           Mode  = Active        Gcchange = -
Port-channel    = Po1         GC    = -         Pseudo port-channel = Po1
Port index      = 0           Load  = 0x00          Protocol = -

Flags:  S - Device is sending Slow LACPDUs.       F - Device is sending fast
                                                  LACPDUs.
        A - Device is in active mode.             P - Device is in passive mode.

Local information:

                     LACP port     Admin          Oper    Port     Port
Port   Flags  State  Priority      Key            Key     Number   State
Fa0/3  SA     bndl   32768         0x1            0x1     0x2      0x3D

Partner’s information:

          Partner               Partner                          Partner
Port      System ID             Port Number          Age         Flags
Fa0/3     00001,0014.a9e5.d640  0x3                  5s          SP

          LACP Partner         Partner              Partner
          Port Priority        Oper Key             Port State
          32768                0x1                  0x3C

Age of the port in the current state: 00d:00h:00m:29s
                Port-channels in the group:
                ----------------------

Port-channel: Po1    (Primary Aggregator)

------------

Age of the Port-channel = 00d:00h:13m:50s
Logical slot/port   = 1/0          Number of ports = 3
HotStandBy port = null
Port state          = Port-channel Ag-Inuse
Protocol            = LACP

Ports in the Port-channel:

Index   Load   Port    EC state
------+------+------+------------
0       00     Fa0/1   Active
0       00     Fa0/2   Active
0       00     Fa0/3   Active

Time since last port bundled:    00d:00h:00m:32s    Fa0/3
Time since last port Un-bundled: 00d:00h:00m:49s    Fa0/1
```

LACP 配置和统计信息，也可通过执行 `show lacp [options]` 命令查看。这条命令下的可用选项，如下输出中所示：


```console
Switch-1#show lacp ?
  <1-6>     Channel group number
  counters  Traffic information
  internal  Internal information
  neighbor  Neighbor information
  sys-id    LACP System ID
```

其中 `[counters]` 关键字提供有关 LACP 发送及接收到的数据包的信息。这条命令打印出的输出如下所示。

```console
Switch-1#show lacp counters
          LACPDUs        Marker     Marker Response     LACPDUs
Port    Sent   Recv    Sent   Recv    Sent   Recv       Pkts Err
---------------------------------------------------------------------
Channel group: 1
Fa0/1   14     12      0      0       0      0          0
Fa0/2   21     18      0      0       0      0          0
Fa0/3   21     18      0      0       0      0          0
```

`[internal]` 关键字提供诸如端口状态、管理密钥、LACP 端口优先级及端口编号等信息。这在以下输出中得以演示：

```console
Switch-1#show lacp internal
Flags:  S - Device is sending Slow LACPDUs. F - Device is sending Fast
                                            LACPDUs.
        A - Device is in Active mode.       P - Device is in Passive mode.

Channel group 1
                        LACP port    Admin    Oper   Port    Port
Port      Flags  State  Priority     Key      Key    Number  State
Fa0/1     SA     bndl   32768        0x1      0x1    0x0     0x3D
Fa0/2     SA     bndl   32768        0x1      0x1    0x1     0x3D
Fa0/3     SA     bndl   32768        0x1      0x1    0x2     0x3D
```


而 `[neighbor]` 关键字则会打印出邻居名字、LACP 邻居的 ID、邻居设备 ID（MAC）及邻居的端口。这些标识还表明了邻居所运行的模式，以及其是否是个物理的学习者等。这在以下输出中得以说明：


```console
Switch-1#show lacp neighbor
Flags:  S - Device is sending Slow LACPDUs. F - Device is sending Fast
                                            LACPDUs.
        A - Device is in Active mode.       P - Device is in Passive mode.

Channel group 1 neighbors

Partner’s information
          Partner               Partner                     Partner
Port      System ID             Port Number     Age         Flags
Fa0/1     00001,0014.a9e5.d640  0x1             11s         SP

          LACP Partner         Partner         Partner
          Port Priority        Oper Key        Port State
          32768                0x1             0x3C

Partner’s information:

          Partner               Partner                     Partner
Port      System ID             Port Number     Age         Flags
Fa0/2     00001,0014.a9e5.d640  0x2             19s         SP

          LACP Partner         Partner         Partner
          Port Priority        Oper Key        Port State
          32768                0x1             0x3C

Partner’s information:

          Partner               Partner                     Partner
Port      System ID             Port Number     Age         Flags
Fa0/3     00001,0014.a9e5.d640  0x3             24s         SP

          LACP Partner         Partner         Partner
          Port Priority        Oper Key        Port State
          32768                0x1             0x3C
```

最后，`[sys-id]` 这个关键字提供了本地交换机的系统 ID。如以下输出中所示，这是个交换机 MAC 与 LACP 优先级的组合：



```console
Switch-1#show lacp sys-id
1    ,000d.bd06.4100
```

> *知识点*：
>
> - an LACP EtherChannel
>
> - an LACP Layer 2 EtherChannel
>
> - the EtherChannel protocol
>
> - By default, LACP allows up to 16 ports to be entered into a port channel group
>
> - the hot-standy state
>
> - the port state, administrative key, LACP port priority, and the port number
>
> - the neighbor name, ID of the LACP neighbor, the neighbor device ID(MAC), and the neighbor port
>
> - a physical learner
>
> - the system ID of the local switch, a combination of the switch MAC and LACP priority


请参加 [Free CCNA Training Bonus – Cisco CCNA in 60 Days v4](https://www.in60days.com/free/ccnain60days/) 处今天的考试。


