# 通配符掩码

通配符掩码是 ACL 与一些路由协议中命令行配置的一部分，因此必须要学习通配符掩码。他们之所以存在，是因为必须要有一种告诉路由器，咱们打算匹配 IP 地址或网络地址哪些部分的方法。

匹配是在二进制级别完成的，但咱们可使用与子网掩码相同的表示法，轻松配置通配符的掩码。二进制 `1` 告诉路由器要忽略这个数字，`0` 表示要匹配这个数字。

执行 CCNA 考试通配符掩码计算的简单方法，就是要确保咱们加一个数到子网掩码，以给到咱们 255 的总数。因此，当咱们在一个八位组中的子网掩码为 192 时，那么咱们就要把 63 加上他得到 255。当其为 255 时，咱们就要加上 0。请看下面的这些示例：


<table>
<tr>
<th>子网</th><td>255</td><td>255</td><td>255</td><td>192</td>
</tr>
<tr>
<th>通配符</th><td>0</td><td>0</td><td>0</td><td>63</td>
</tr>
<tr>
<th>等于</th><td>255</td><td>255</td><td>255</td><td>255</td>
</tr>
</table>

<table>
<tr>
<th>子网</th><td>255</td><td>255</td><td>224</td><td>0</td>
</tr>
<tr>
<th>通配符</th><td>0</td><td>0</td><td>31</td><td>255</td>
</tr>
<tr>
<th>等于</th><td>255</td><td>255</td><td>255</td><td>255</td>
</tr>
</table>

<table>
<tr>
<th>子网</th><td>255</td><td>128</td><td>0</td><td>0</td>
</tr>
<tr>
<th>通配符</th><td>0</td><td>127</td><td>255</td><td>255</td>
</tr>
<tr>
<th>等于</th><td>255</td><td>255</td><td>255</td><td>255</td>
</tr>
</table>

当咱们希望咱们的 ACL，匹配某个子网或整个网络时，咱们就需要输入通配符掩码。例如，当咱们打算匹配 `172.20.1.0 255.255.224.0` 时，咱们就要输入以下命令：

````console
Router(config)#access-list 1 permit 172.20.1.0 0.0.31.255
```


匹配子网 `192.200.1.0 255.255.255.192`，将需要以下语句：


```console
Router(config)#access-list 1 permit 192.200.1.0 0.0.0.63
```

在对同样需要通配符掩码的 OSPF 应用一些网络语句时要当心。

当咱们有着某个有两个主机位的网络，而咱们需要输入一个 ACL 匹配这些主机位时，这种同样的原则也适用。例如，匹配子网 `192.168.1.0 255.255.255.252` 或 `/30` 时，咱们就需要输入以下命令：


```console
Router(config)#access-list 1 permit 192.168.1.0 0.0.0.3
```

我（作者）省略了一些配置，因为我只想显示相关部分。上面这条语句，将匹配 `192.168.1.0` 网络上的主机 `1` 及主机 `2`。当咱们打算匹配 `192.168.1.4/30` 网络上的主机 `5` 与主机 `6` 时，那么咱们需要输入以下命令：


```console
Router(config)#access-list 1 permit 192.168.1.4 0.0.0.3
```

要阅读 [子网划分](../d02/subnetting.md) 与 [VLSM](../d02/VLSM.md) 的课文，进一步了解这一概念。这点很重要！


